// /*var validation = */(function(){

//     var me = {};

//      me.isEmail = function(email){

//         //для регулярн выражений использовать генераторы(см в интернете)
//         var re = /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-9-0]+\.)+[a-zA-Z]{2,}))$/;
        
//         //после проверки вернет true или faulse
//         return re.test(email);
//     };

//     //будет глобальная и доступна во всех файлах(см темы про модульность)
//     window.validation = me;
//     //return me;
// }());